import random
from VIPMUSIC.utils.database import get_served_chats
from pyrogram import Client, filters

from VIPMUSIC import app

# Define a dictionary to track the last message timestamp for each user
user_last_message_time = {}
user_command_count = {}
# Define the threshold for command spamming (e.g., 20 commands within 60 seconds)
SPAM_THRESHOLD = 2
SPAM_WINDOW_SECONDS = 5

from pyrogram.types import InlineKeyboardButton, InlineKeyboardMarkup, Message

SHAYRI = [
" **𝑷𝒆𝒏𝒏𝒆𝒚 𝑵𝒆 𝑷𝒂𝒌𝒌𝒂 𝑷𝒂𝒓𝒐𝒕𝒕𝒂 😋✨ 𝑼𝒏 𝑽𝒆𝒆𝒕𝒖𝒌𝒌𝒖 𝑴𝒂𝒑𝒊𝒍𝒂𝒊 𝒂𝒉 𝑵𝒂𝒂𝒏 𝑽𝒂𝒓𝒂𝒕𝒕𝒂🙈✨** ",
           " **𝑵𝒆𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏 𝑲𝒂𝒏𝒂𝒗𝒖 𝑲𝒂𝒏𝒏𝒊 🙈✨ 𝑬𝒏 𝑻𝒉𝒂𝒎𝒃𝒉𝒊𝒌𝒌𝒖 𝑵𝒆 𝑻𝒉𝒂𝒏 𝒅𝒊 𝑨𝒏𝒏𝒊 🤤✨** ",
           " **𝑵𝒆𝒆 𝑲𝒖𝒑𝒕𝒂 𝑵𝒆𝒗𝒆𝒓 𝑳𝒂𝒕𝒆 - 𝒖𝒉 🤭✨ 𝑽𝒂𝒏𝒅𝒉𝒐𝒏𝒆𝒚 𝑻𝒉𝒐𝒓𝒂 𝑮𝒂𝒕𝒆 - 𝒖𝒉 😚✨ 𝑵𝒆𝒆𝒕𝒉𝒂𝒏 𝑬𝒏𝒂𝒌𝒌𝒖 𝑭𝒂𝒕𝒆 - 𝒖𝒉 😋✨ 𝑬𝒏 𝑲𝒐𝒅𝒂 𝑽𝒂𝒛𝒉𝒌𝒂𝒊 𝑶𝒐𝒕𝒕𝒖 💙✨** ",
           " **𝑷𝒂𝒍𝒍𝒖 𝑽𝒆𝒍𝒂𝒌𝒌𝒂 𝑻𝒉𝒆𝒗𝒂 𝑩𝒓𝒖𝒔𝒉 - 𝒖𝒉 😬✨ 𝑵𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏𝒂𝒌𝒌𝒖 𝑪𝒓𝒖𝒔𝒉 - 𝒖𝒉 😘✨ 𝑵𝒂𝒎𝒂𝒌𝒖𝒍𝒍𝒂 𝑬𝒅𝒉𝒖𝒌𝒖 𝑹𝒖𝒔𝒉 - 𝒖𝒉 🥵✨ 𝒀𝒐𝒖 𝒂𝒓𝒆 𝑶𝒏𝒍𝒚 𝑴𝒚 𝑾𝒊𝒔𝒉 - 𝒖𝒉 😇✨** ",
           " **𝑼𝒌𝒌𝒂𝒓𝒂 𝒕𝒉𝒆𝒗𝒂 𝑪𝒉𝒂𝒊𝒓 - 𝒖𝒉 🪑✨ 𝑵𝒆𝒆 𝑲𝒂𝒂𝒕𝒖 𝑬𝒏 𝑴𝒆𝒍𝒂 𝑪𝒂𝒓𝒆 - 𝒖𝒉 🤗✨ 𝑼𝒏 𝑲𝒂𝒊𝒚𝒂𝒂𝒍𝒂 𝑷𝒐𝒅𝒖 𝑺𝒐𝒐𝒓𝒖 🍚✨ 𝑨𝒅𝒉𝒖𝒏𝒂𝒂𝒍𝒂 𝑽𝒊𝒕𝒖𝒓𝒖𝒗𝒆𝒏 𝑩𝒆𝒆𝒓 - 𝒖𝒉 🍻✨** ",
           " **𝑴𝒂𝒛𝒉𝒂𝒊𝒚𝒊𝒍𝒂 𝑨𝒂𝒅𝒖𝒎 𝑴𝒂𝒚𝒊𝒍 -𝒖𝒉 🦚✨ 𝑬𝒏 𝑰𝒓𝒖𝒕𝒕𝒖𝒍𝒂 𝑵𝒆𝒆𝒕𝒉𝒂𝒏 𝑽𝒆𝒚𝒊𝒍 - 𝒖𝒉 🌅✨ 𝑴𝒖𝒌𝒌𝒊 𝑷𝒂𝒅𝒊𝒄𝒉𝒖𝒎 𝑨𝒂𝒏𝒆𝒏 𝑭𝒂𝒊𝒍 - 𝒖𝒉 🙇‍♂️✨ 𝑵𝒆 𝒊𝒍𝒍𝒂𝒅𝒉𝒂 𝑽𝒂𝒛𝒉𝒌𝒂𝒊 𝑱𝒂𝒊𝒍 - 𝒖𝒉 🏤✨** ",
           " **𝑶𝒓𝒖 𝑻𝒉𝒂𝒓𝒂 𝑽𝒂𝒓𝒂𝒊𝒌𝒌𝒖𝒎 𝑷𝒆𝒔𝒖 🥲✨ 𝑼𝒏 𝑴𝒐𝒐𝒄𝒉𝒊 𝑲𝒂𝒂𝒕𝒉𝒖 𝑽𝒆𝒆𝒔𝒖 🌬️✨ 𝑬𝒏𝒂𝒌𝒌𝒂 𝑷𝒂𝒅𝒂𝒄𝒉𝒂𝒏 𝒀𝒆𝒔𝒖 ⛪✨ 𝑵𝒂𝒂𝒏 𝑨𝒂𝒈𝒊 𝑵𝒊𝒌𝒌𝒖𝒓𝒆𝒏 𝑳𝒐𝒐𝒔𝒖 🤪** ",
           " **𝑷𝒂𝒕𝒕𝒂𝒔𝒖 𝑲𝒐𝒍𝒖𝒕𝒉𝒖𝒏𝒂 𝑽𝒆𝒅𝒊𝒌𝒌𝒖𝒎 🎆✨ 𝑵𝒆𝒆 𝑰𝒍𝒍𝒂𝒏𝒂 𝒆𝒏 𝑯𝒆𝒂𝒓𝒕 𝑻𝒉𝒖𝒅𝒊𝒌𝒌𝒖𝒎 💓** ",
           " **𝑪𝒚𝒄𝒍𝒆 𝑶𝒐𝒅𝒂 𝑻𝒉𝒆𝒗𝒂 𝑾𝒉𝒆𝒆𝒍 - 𝒖𝒉 🚲✨ 𝑵𝒆 𝑷𝒆𝒔𝒂𝒍𝒂𝒏𝒂 𝑨𝒂𝒈𝒖𝒅𝒉𝒖 𝑭𝒆𝒆𝒍 - 𝒖𝒉 🥺✨** ",
           " **𝑶𝒐𝒓𝒖𝒌𝒌𝒖 𝑷𝒐𝒗𝒂𝒏𝒈𝒂 𝒃𝒖𝒔𝒖𝒍𝒂 🚌✨ 𝑵𝒆𝒆 𝑰𝒓𝒖𝒌𝒌𝒂 𝑬𝒏 𝑴𝒂𝒏𝒂𝒔𝒖𝒍𝒂 💝✨** ",
           " **𝑽𝒄 𝒍𝒂 𝒑𝒐𝒅𝒂𝒍𝒂𝒎 𝑴𝒖𝒕𝒆 - 𝒖𝒉 🤐✨ 𝑺𝒉𝒐𝒓𝒕 𝑮𝒊𝒓𝒍𝒔 𝑨𝒓𝒆 𝑪𝒖𝒕𝒆 - 𝒖𝒉 😍✨** ",
           " **𝑷𝒂𝒂𝒕𝒊 𝑺𝒆𝒊𝒚𝒖𝒎 𝑽𝒂𝒊𝒕𝒉𝒊𝒚𝒂𝒎 👵✨ 𝑰𝒅𝒉𝒂 𝑹𝒆𝒂𝒅 𝑷𝒂𝒏𝒅𝒓𝒂 𝑵𝒆𝒆 𝑷𝒂𝒊𝒕𝒉𝒊𝒚𝒂𝒎 🤪✨** ",
           " **𝑻𝒉𝒊𝒓𝒖𝒑𝒂𝒕𝒉𝒊 𝒍𝒂 𝑨𝒅𝒊𝒑𝒑𝒂𝒏𝒈𝒂 𝑴𝒐𝒕𝒕𝒂 👨‍🦲✨ 𝑵𝒆𝒆 𝑻𝒉𝒂𝒏 𝑰𝒏𝒅𝒉𝒂 𝑮𝒓𝒐𝒖𝒑 𝒍𝒂𝒚𝒆 𝑲𝒖𝒕𝒕𝒂 🤣✨** ",
           " **𝑲𝒂𝒂𝒊 𝑲𝒂𝒓𝒊 𝑽𝒆𝒕𝒕𝒂 𝑻𝒉𝒆𝒗𝒂 𝑲𝒏𝒊𝒇𝒆 - 𝒖𝒉 🔪✨ 𝑵𝒆𝒆𝒏𝒈𝒂 𝑻𝒉𝒂𝒏 𝑬𝒏 𝑾𝒊𝒇𝒆 - 𝒖𝒉 👰✨** ",
           " **𝒌𝒂𝒅𝒂𝒊 𝒍𝒂 𝑰𝒓𝒖𝒌𝒌𝒖𝒎 𝑺𝒆𝒎𝒊𝒚𝒂🍜✨ 𝑼𝒏𝒈𝒂 𝑨𝒎𝒎𝒂 𝑻𝒉𝒂𝒏 𝑬𝒏𝒂𝒌𝒌𝒖 𝑴𝒂𝒎𝒊𝒚𝒂 🙈✨** ",
           " **𝑪𝒓𝒊𝒄𝒌𝒆𝒕 𝑷𝒍𝒂𝒚 𝑷𝒂𝒏𝒏𝒂 𝑻𝒉𝒆𝒗𝒂 𝑩𝒂𝒍𝒍 - 𝒖𝒉 🏏✨ 𝑰𝒅𝒉𝒂 𝑹𝒆𝒂𝒅 𝑷𝒂𝒏𝒅𝒓𝒂 𝑵𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏 𝑨𝒂𝒍𝒖 🙈✨**",
           " **𝑬𝒏 𝑫𝒐𝒈 𝑵𝒂𝒎𝒆 𝑩𝒐𝒃𝒃𝒚 🐩✨ 𝑼𝒏𝒂𝒌𝒌𝒖 𝑴𝒆𝒔𝒔𝒂𝒈𝒆 𝑷𝒂𝒏𝒅𝒓𝒂𝒅𝒉𝒖 𝒕𝒉𝒂𝒏 𝒆𝒏 𝑯𝒐𝒃𝒃𝒚 🙈✨** ",
           " **𝑲𝒐𝒓𝒂𝒏𝒈𝒖 𝒌𝒌𝒖 𝒊𝒓𝒖𝒌𝒌𝒖𝒎 𝑽𝒂𝒂𝒍𝒖 🐒✨ 𝑵𝒆𝒆 𝒕𝒉𝒂𝒏 𝑬𝒏 𝑨𝒂𝒍𝒖 💌🙀✨** ",
           " **𝑵𝒂𝒂𝒏 𝑻𝒉𝒂𝒏 𝑼𝒏 𝑫𝒉𝒐𝒏𝒊 🤙 𝑬𝒏𝒏𝒐𝒅𝒂 𝑽𝒂𝒂 𝒏𝒆𝒆 🤗 𝑻𝒉𝒂𝒏𝒈𝒂𝒎 𝑷𝒐𝒍 𝑷𝒂𝒍𝒂𝒑𝒂𝒍𝒂𝒌𝒖𝒅𝒉𝒂𝒅𝒊 𝑼𝒏𝒏𝒐𝒅𝒂 𝑴𝒆𝒏𝒊 😅✨** ",
           " **𝑵𝒂𝒂𝒏 𝑻𝒉𝒂𝒏 𝑼𝒏 𝑹𝒂𝒊𝒏𝒂 😎 𝑵𝒆𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏 𝑸𝒖𝒆𝒆𝒏 - 𝑨𝒉 👸 𝑽𝒂𝒂𝒏𝒂𝒕𝒉𝒊𝒍 𝑷𝒂𝒓𝒂𝒌𝒌𝒖𝒅𝒉𝒖 𝑷𝒂𝒂𝒓 𝒄𝒐𝒍𝒐𝒓 𝒄𝒐𝒍𝒐𝒓 𝒂𝒉 𝑴𝒂𝒊𝒏𝒂 🥀✨** ",
           " **𝑨𝒅𝒊 𝑲𝒂𝒕𝒓𝒊𝒏𝒂 𝑲𝒊𝒇𝒆 - 𝑼𝒉 🙈 𝑵𝒆𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏𝒂𝒌𝒌𝒖 𝑾𝒊𝒇𝒆 - 𝑼𝒉 👰 𝑬𝒏𝒏𝒐𝒅𝒂 𝑵𝒆 𝑰𝒓𝒖𝒏𝒅𝒉𝒂 𝑵𝒂𝒍𝒍𝒂 𝑰𝒓𝒖𝒌𝒌𝒖𝒎 𝑳𝒊𝒇𝒆 - 𝑼𝒉 🤍💌✨** ",
           " ** 𝑺𝒖𝒑𝒆𝒓𝒎𝒂𝒏 𝑨𝒉 𝑷𝒐𝒍𝒂 𝑵𝒂𝒂𝒏𝒖𝒎 𝑷𝒂𝒓𝒂𝒏𝒅𝒉𝒖 𝑽𝒂𝒓𝒖𝒗𝒂𝒏 𝑫𝒊 😍  𝑼𝒏𝒏𝒂 𝑻𝒉𝒐𝒐𝒌𝒊 𝑷𝒐𝒊 𝒖𝒉 𝑻𝒉𝒂𝒂𝒍𝒊 𝑲𝒂𝒕𝒕𝒊 𝑽𝒂𝒛𝒉𝒌𝒂𝒊 𝑻𝒉𝒂𝒓𝒖𝒗𝒆𝒏 𝑫𝒊 🤭✨** ",
           " **𝑷𝒂𝒂𝒚𝒂𝒔𝒂𝒕𝒉𝒖𝒍𝒂 𝒊𝒓𝒖𝒌𝒌𝒖𝒎 𝑴𝒖𝒏𝒅𝒉𝒊𝒓𝒊 😋✨ 𝑵𝒆𝒆 𝑻𝒉𝒂𝒏 𝑬𝒏 𝑺𝒐𝒑𝒑𝒂𝒏𝒂 𝑺𝒖𝒏𝒅𝒉𝒂𝒓𝒊 😅✨** ",
           " **𝑻𝒉𝒐𝒐𝒌𝒌𝒂𝒕𝒉𝒖𝒍𝒂 𝑽𝒂𝒓𝒖𝒎 𝑲𝒂𝒏𝒂𝒗𝒖 😴 𝑬𝒑𝒑𝒐𝒅𝒉𝒖𝒎 𝑼𝒏𝒏𝒐𝒅𝒂 𝑵𝒊𝒏𝒂𝒊𝒗𝒖 🤗✨** ",
           " **𝑺𝒖𝒏𝒅𝒂𝒚 𝑷𝒐𝒗𝒂𝒏𝒈𝒂 𝑩𝒂𝒓 - 𝑼𝒉 🍾🍻 𝑼𝒏𝒏𝒂 𝑷𝒂𝒂𝒕𝒉𝒂𝒅𝒉𝒖 𝑨𝒂𝒈𝒊𝒕𝒆𝒏 𝑮𝒂𝒓 - 𝑼𝒉 🥴✨** ",
           " **𝑾𝒊𝒏𝒆𝒔𝒉𝒐𝒑 𝒍𝒂 𝑰𝒓𝒖𝒌𝒌𝒖𝒎 𝑩𝒆𝒆𝒓 - 𝑼𝒉 🍾✨ 𝑵𝒆𝒆 𝑰𝒍𝒍𝒂𝒅𝒉𝒂 𝑳𝒊𝒇𝒆  𝒖𝒉 𝑩𝒐𝒓𝒆 - 𝑼𝒉 🥱✨** ",
           " **𝑴𝒂𝒕𝒉𝒔 𝑲𝒖 𝑻𝒂𝒎𝒊𝒍 𝒍𝒂 𝑲𝒂𝒏𝒂𝒌𝒌𝒖 🧮 𝑬𝒑𝒑𝒐 𝑶𝒌 𝑺𝒐𝒍𝒍𝒖𝒗𝒂 𝑬𝒏𝒂𝒌𝒌𝒖 🙈✨** ",
           " **𝑸𝒖𝒆𝒆𝒏 𝒌𝒌𝒖 𝑷𝒂𝒊𝒓 𝑲𝒊𝒏𝒈 - 𝑼𝒉 🤴 𝑼𝒏𝒂𝒌𝒌𝒖 𝑷𝒐𝒕𝒕𝒖 𝑽𝒊𝒅𝒂𝒗𝒂 𝑹𝒊𝒏𝒈 - 𝑼𝒉 💍✨** ",
           " **𝑼𝒏 𝑩𝒅𝒂𝒚 𝑲𝒌𝒖 𝑻𝒉𝒂𝒓𝒆𝒏 𝑮𝒊𝒇𝒕 - 𝑼𝒉🛍 𝑬𝒏𝒂𝒌𝒌𝒖 𝑳𝒊𝒇𝒆 𝑳𝒐𝒏𝒈 𝑻𝒉𝒂𝒓𝒖𝒗𝒊𝒚𝒂 𝑳𝒊𝒇𝒕 - 𝑼𝒉 🤭✨** ",
           " **𝑻𝒉𝒂𝒍𝒂𝒊𝒍𝒂 𝑻𝒉𝒆𝒊𝒑𝒑𝒂𝒏𝒈𝒂 𝑬𝒏𝒏𝒂 🤪 𝑰𝒅𝒉𝒖𝒗𝒂𝒓𝒂𝒊𝒌𝒖𝒎 𝑷𝒂𝒂𝒕𝒉𝒂𝒅𝒉𝒖 𝑰𝒍𝒍𝒂 𝑼𝒏𝒏𝒂 𝑴𝒂𝒂𝒓𝒊 𝑶𝒓𝒖 𝑨𝒍𝒂𝒈𝒂𝒏𝒂 𝑷𝒐𝒏𝒏𝒂 🤩✨** ",
           " **𝑺𝒂𝒎𝒂𝒚𝒂𝒍 𝑺𝒆𝒊𝒚𝒚𝒂 𝑻𝒉𝒆𝒗𝒂 𝑺𝒕𝒐𝒗𝒆 - 𝑼𝒉 𝑵𝒂𝒎𝒎𝒂 𝑹𝒆𝒏𝒅𝒖 𝑷𝒆𝒓𝒖𝒎 𝑷𝒂𝒏𝒏𝒂𝒍𝒂𝒎 𝑨𝒉 𝑳𝒐𝒗𝒆 - 𝑼𝒉 💙**" ]

# Command
SHAYRI_COMMAND = ["pickup", "uruttu", "love"]


@app.on_message(filters.command(SHAYRI_COMMAND) & filters.group)
async def help(client: Client, message: Message):
    await message.reply_text(
        text=random.choice(SHAYRI),
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "🍷 𝐒𖽪𖽳𖽳𖽙𖽷𖾓 😻", url=f"https://t.me/izzy_tamil_junction"
                    ),
                    InlineKeyboardButton(
                        "🍷 𝐎𖾟𖽡𖽞𖾖 😻", url=f"https://t.me/Itz_alpha_dude"
                    ),
                ]
            ]
        ),
    )


@app.on_message(filters.command(SHAYRI_COMMAND) & filters.private)
async def help(client: Client, message: Message):
    await message.reply_text(
        text=random.choice(SHAYRI),
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "🍷 𝐒𖽪𖽳𖽳𖽙𖽷𖾓 😻", url=f"https://t.me/izzy_tamil_junction"
                    ),
                    InlineKeyboardButton(
                         "🍷 𝐎𖾟𖽡𖽞𖾖 😻", url=f"https://t.me/Itz_alpha_dude"
                    ),
                ]
            ]
        ),
    )


__MODULE__ = "Sʜᴀʏᴀʀɪ"
__HELP__ = """
/ɢғ, /ʙғ, /sʜᴀʏʀɪ, /sᴀʀɪ, /sʜᴀʀɪ, /ᴏᴠᴇ: Gᴇᴛ ᴀ ʀᴀɴᴅᴏᴍ Sʜᴀʏᴀʀɪ.

Tʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴡᴏʀᴋs ɪɴ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ ᴄʜᴀᴛs. Iᴛ ᴘʀᴏᴠɪᴅᴇs ᴀ ʀᴀɴᴅᴏᴍ ᴘɪᴇᴄᴇ ᴏғ Sʜᴀʏᴀʀɪ ғʀᴏᴍ ᴀ ᴘʀᴇᴅᴇғɪɴᴇᴅ ɪsᴛ. Tʜᴇ ʀᴇᴘʏ ɪɴᴄᴜᴅᴇs ʙᴜᴛᴛᴏɴs ғᴏʀ sᴜᴘᴘᴏʀᴛ ᴀɴᴅ ᴏғғɪᴄɪᴀ ᴄʜᴀɴɴᴇs.

Fᴇᴀᴛᴜʀᴇs:
- Pʀᴏᴠɪᴅᴇs ᴀ ʀᴀɴᴅᴏᴍ Sʜᴀʏᴀʀɪ ᴏɴ ᴄᴏᴍᴍᴀɴᴅ.
- Aᴠᴀɪᴀʙᴇ ɪɴ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ ᴄʜᴀᴛs.
- Iɴᴄᴜᴅᴇs ɪɴɪɴᴇ ᴋᴇʏʙᴏᴀʀᴅ ʙᴜᴛᴛᴏɴs ғᴏʀ ᴀᴅᴅɪᴛɪᴏɴᴀ sᴜᴘᴘᴏʀᴛ ᴀɴᴅ ᴏғғɪᴄɪᴀ ɪɴᴋs.

Cᴏᴍᴍᴀɴᴅs:
- /ɢғ
- /ʙғ
- /sʜᴀʏʀɪ
- /sᴀʀɪ
- /sʜᴀʀɪ
- /ᴏᴠᴇ

Nᴏᴛᴇ: Tʜɪs ʙᴏᴛ ᴘʀᴏᴠɪᴅᴇs ɪɴᴋs ᴛᴏ sᴜᴘᴘᴏʀᴛ ᴀɴᴅ ᴏғғɪᴄɪᴀ ᴄʜᴀɴɴᴇs ғᴏʀ ғᴜʀᴛʜᴇʀ ᴀssɪsᴛᴀɴᴄᴇ.
"""





from apscheduler.schedulers.asyncio import AsyncIOScheduler
from pyrogram import filters
from pyrogram.types import InlineKeyboardButton, InlineKeyboardMarkup
import random

from VIPMUSIC import app

# Define the scheduler
scheduler = AsyncIOScheduler(timezone="Asia/Kolkata")

# List of funny and cute shayari for night


night_shayari = [ "🌙 ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ʙᴇ ᴀꜱ ꜱᴡᴇᴇᴛ ᴀꜱ ᴛʜᴇ ꜰɪʀꜱᴛ ʙɪᴛᴇ ᴏꜰ ʏᴏᴜʀ ꜰᴀᴠᴏʀɪᴛᴇ ᴅᴇꜱꜱᴇʀᴛ. ᴀꜱ ʏᴏᴜ ᴅʀɪꜰᴛ ᴏꜰꜰ ᴛᴏ ꜱʟᴇᴇᴘ, ᴍᴀʏ ʏᴏᴜʀ ᴍɪɴᴅ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴘᴇᴀᴄᴇꜰᴜʟ ᴛʜᴏᴜɢʜᴛꜱ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ʟɪɢʜᴛ. ʀᴇᴍᴇᴍʙᴇʀ, ᴇᴠᴇʀʏ ᴅʀᴇᴀᴍ ɪꜱ ᴀ ᴡɪꜱʜ ʏᴏᴜʀ ʜᴇᴀʀᴛ ᴍᴀᴋᴇꜱ, ꜱᴏ ʟᴇᴛ ᴛʜᴇ ɴɪɢʜᴛ ʙᴇ ꜰᴜʟʟ ᴏꜰ ᴡᴏɴᴅᴇʀ ᴀɴᴅ ᴊᴏʏ ꜰᴏʀ ʏᴏᴜ. ꜱʟᴇᴇᴘ ᴛɪɢʜᴛ ᴀɴᴅ ʜᴀᴠᴇ ᴛʜᴇ ꜱᴡᴇᴇᴛᴇꜱᴛ ᴅʀᴇᴀᴍꜱ. ɢᴏᴏᴅ ɴɪɢʜᴛ!", "🌜 ꜱʟᴇᴇᴘ ᴡᴇʟʟ, ᴀɴᴅ ᴍᴀʏ ʏᴏᴜʀ ɴɪɢʜᴛ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ꜱᴛᴀʀꜱ ᴛʜᴀᴛ ʟɪɢʜᴛ ᴜᴘ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ. ɪᴍᴀɢɪɴᴇ ᴀ ᴡᴏʀʟᴅ ᴡʜᴇʀᴇ ᴇᴠᴇʀʏᴛʜɪɴɢ ʏᴏᴜ ᴅᴇꜱɪʀᴇ ᴄᴏᴍᴇꜱ ᴛʀᴜᴇ, ᴀɴᴅ ʟᴇᴛ ᴛʜᴀᴛ ᴛʜᴏᴜɢʜᴛ ᴄᴀʀʀʏ ʏᴏᴜ ɪɴᴛᴏ ᴀ ʙʟɪꜱꜱꜰᴜʟ ꜱʟᴇᴇᴘ. ᴍᴀʏ ʏᴏᴜʀ ᴘɪʟʟᴏᴡ ʙᴇ ᴀꜱ ꜱᴏꜰᴛ ᴀꜱ ᴄʟᴏᴜᴅꜱ ᴀɴᴅ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ᴀꜱ ᴍᴀɢɪᴄᴀʟ ᴀꜱ ꜰᴀɪʀʏ ᴛᴀʟᴇꜱ. ɢᴏᴏᴅ ɴɪɢʜᴛ ᴀɴᴅ ꜱᴡᴇᴇᴛ ᴅʀᴇᴀᴍꜱ, ᴍᴀʏ ʏᴏᴜ ᴡᴀᴋᴇ ᴜᴘ ʀᴇꜰʀᴇꜱʜᴇᴅ ᴀɴᴅ ʀᴇᴀᴅʏ ᴛᴏ ᴄᴏɴQᴜᴇʀ ᴛʜᴇ ᴅᴀʏ!", "✨ ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ʏᴏᴜʀ ꜱʟᴇᴇᴘ ʙᴇ ᴀꜱ ᴅᴇᴇᴘ ᴀꜱ ᴛʜᴇ ᴏᴄᴇᴀɴ ᴀɴᴅ ᴀꜱ ᴘᴇᴀᴄᴇꜰᴜʟ ᴀꜱ ᴀ ᴄᴀʟᴍ ʟᴀᴋᴇ. ᴀꜱ ʏᴏᴜ ᴄʟᴏꜱᴇ ʏᴏᴜʀ ᴇʏᴇꜱ, ʟᴇᴛ ɢᴏ ᴏꜰ ᴀʟʟ ᴡᴏʀʀɪᴇꜱ ᴀɴᴅ ꜱᴛʀᴇꜱꜱ. ᴅʀᴇᴀᴍ ᴏꜰ ʙᴇᴀᴜᴛɪꜰᴜʟ ᴘʟᴀᴄᴇꜱ ᴀɴᴅ ᴊᴏʏꜰᴜʟ ᴍᴏᴍᴇɴᴛꜱ, ᴀɴᴅ ʟᴇᴛ ᴛʜᴏꜱᴇ ᴅʀᴇᴀᴍꜱ ꜰɪʟʟ ʏᴏᴜʀ ɴɪɢʜᴛ ᴡɪᴛʜ ʜᴀᴘᴘɪɴᴇꜱꜱ. ʀᴇᴍᴇᴍʙᴇʀ, ᴛʜᴇ ɴɪɢʜᴛ ɪꜱ ᴀ ᴄᴀɴᴠᴀꜱ ꜰᴏʀ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ, ꜱᴏ ᴘᴀɪɴᴛ ɪᴛ ᴡɪᴛʜ ᴛʜᴇ ᴄᴏʟᴏʀꜱ ᴏꜰ ᴊᴏʏ ᴀɴᴅ ᴄᴏɴᴛᴇɴᴛᴍᴇɴᴛ. ꜱʟᴇᴇᴘ ᴡᴇʟʟ!", "🌟 ᴡɪꜱʜɪɴɢ ʏᴏᴜ ᴀ ʀᴇꜱᴛꜰᴜʟ ɴɪɢʜᴛ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ꜱᴡᴇᴇᴛ ᴅʀᴇᴀᴍꜱ ᴀɴᴅ ᴡᴀʀᴍ ʜᴜɢꜱ. ᴍᴀʏ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ʙᴇ ᴀꜱ ᴅᴇʟɪɢʜᴛꜰᴜʟ ᴀꜱ ᴀ ꜱᴜʀᴘʀɪꜱᴇ ɢɪꜰᴛ ᴀɴᴅ ᴀꜱ ᴄᴏᴍꜰᴏʀᴛɪɴɢ ᴀꜱ ᴀ ᴄᴏᴢʏ ʙʟᴀɴᴋᴇᴛ. ᴀꜱ ʏᴏᴜ ᴅʀɪꜰᴛ ɪɴᴛᴏ ꜱʟᴜᴍʙᴇʀ, ᴍᴀʏ ʏᴏᴜʀ ᴍɪɴᴅ ʙᴇ ᴀᴛ ᴇᴀꜱᴇ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ʟɪɢʜᴛ. ɢᴏᴏᴅ ɴɪɢʜᴛ, ᴀɴᴅ ᴍᴀʏ ʏᴏᴜ ᴡᴀᴋᴇ ᴜᴘ ᴡɪᴛʜ ᴀ ꜱᴍɪʟᴇ ᴀɴᴅ ᴀ ʜᴇᴀʀᴛ ꜰᴜʟʟ ᴏꜰ ᴘᴏꜱɪᴛɪᴠɪᴛʏ!", "🌙 ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ʙᴇ ᴀꜱ ꜱᴡᴇᴇᴛ ᴀꜱ ʜᴏɴᴇʏ ᴀɴᴅ ᴀꜱ ᴄᴏᴍꜰᴏʀᴛɪɴɢ ᴀꜱ ᴀ ᴡᴀʀᴍ ᴄᴜᴘ ᴏꜰ ᴄᴏᴄᴏᴀ. ᴀꜱ ʏᴏᴜ ʟᴀʏ ᴅᴏᴡɴ ᴛᴏ ʀᴇꜱᴛ, ʟᴇᴛ ᴛʜᴇ ᴛʀᴀɴQᴜɪʟɪᴛʏ ᴏꜰ ᴛʜᴇ ɴɪɢʜᴛ ᴡʀᴀᴘ ᴀʀᴏᴜɴᴅ ʏᴏᴜ ʟɪᴋᴇ ᴀ ꜱᴏꜰᴛ ʙʟᴀɴᴋᴇᴛ. ꜱʟᴇᴇᴘ ᴡᴇʟʟ, ᴀɴᴅ ᴍᴀʏ ʏᴏᴜ ᴡᴀᴋᴇ ᴜᴘ ᴡɪᴛʜ ᴀ ʜᴇᴀʀᴛ ꜰᴜʟʟ ᴏꜰ ɢʀᴀᴛɪᴛᴜᴅᴇ ᴀɴᴅ ᴀ ꜱᴍɪʟᴇ ᴛʜᴀᴛ ʙʀɪɢʜᴛᴇɴꜱ ᴛʜᴇ ᴅᴀʏ. ꜱᴡᴇᴇᴛ ᴅʀᴇᴀᴍꜱ!", "🌛 ᴍᴀʏ ʏᴏᴜʀ ɴɪɢʜᴛ ʙᴇ ᴀꜱ ꜱᴏᴏᴛʜɪɴɢ ᴀꜱ ᴀ ʟᴜʟʟᴀʙʏ ᴀɴᴅ ᴀꜱ ᴄᴏᴍꜰᴏʀᴛɪɴɢ ᴀꜱ ᴀ ʜᴜɢ ꜰʀᴏᴍ ᴀ ʟᴏᴠᴇᴅ ᴏɴᴇ. ᴀꜱ ʏᴏᴜ ᴄʟᴏꜱᴇ ʏᴏᴜʀ ᴇʏᴇꜱ, ɪᴍᴀɢɪɴᴇ ᴀ ᴡᴏʀʟᴅ ᴡʜᴇʀᴇ ᴇᴠᴇʀʏᴛʜɪɴɢ ɪꜱ ᴘᴇʀꜰᴇᴄᴛ ᴀɴᴅ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ᴄᴏᴍᴇ ᴛʀᴜᴇ. ʟᴇᴛ ᴛʜᴇ ᴘᴇᴀᴄᴇ ᴏꜰ ᴛʜᴇ ɴɪɢʜᴛ ᴇᴍʙʀᴀᴄᴇ ʏᴏᴜ ᴀɴᴅ ᴄᴀʀʀʏ ʏᴏᴜ ᴛᴏ ᴀ ᴘʟᴀᴄᴇ ᴏꜰ ᴛʀᴀɴQᴜɪʟɪᴛʏ. ɢᴏᴏᴅ ɴɪɢʜᴛ, ᴀɴᴅ ᴍᴀʏ ʏᴏᴜ ᴡᴀᴋᴇ ᴜᴘ ᴡɪᴛʜ ʀᴇɴᴇᴡᴇᴅ ᴇɴᴇʀɢʏ ᴀɴᴅ ᴊᴏʏ!", "🌌 ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴍᴀɢɪᴄᴀʟ ᴍᴏᴍᴇɴᴛꜱ ᴀɴᴅ ʏᴏᴜʀ ꜱʟᴇᴇᴘ ʙᴇ ᴀꜱ ᴅᴇᴇᴘ ᴀꜱ ᴛʜᴇ ɴɪɢʜᴛ ꜱᴋʏ. ᴀꜱ ʏᴏᴜ ᴅʀɪꜰᴛ ᴏꜰꜰ ᴛᴏ ꜱʟᴇᴇᴘ, ʟᴇᴛ ʏᴏᴜʀ ᴍɪɴᴅ ᴡᴀɴᴅᴇʀ ᴛᴏ ʙᴇᴀᴜᴛɪꜰᴜʟ ᴘʟᴀᴄᴇꜱ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ᴀᴛ ᴘᴇᴀᴄᴇ. ʀᴇᴍᴇᴍʙᴇʀ, ᴛʜᴇ ɴɪɢʜᴛ ɪꜱ ᴀ ᴛɪᴍᴇ ꜰᴏʀ ʀᴇꜱᴛ ᴀɴᴅ ʀᴇᴊᴜᴠᴇɴᴀᴛɪᴏɴ, ꜱᴏ ᴇᴍʙʀᴀᴄᴇ ɪᴛ ꜰᴜʟʟʏ. ꜱʟᴇᴇᴘ ᴡᴇʟʟ ᴀɴᴅ ᴡᴀᴋᴇ ᴜᴘ ʀᴇᴀᴅʏ ꜰᴏʀ ᴀ ʙʀᴀɴᴅ ɴᴇᴡ ᴅᴀʏ!", "💤 ꜱᴡᴇᴇᴛ ᴅʀᴇᴀᴍꜱ! ᴍᴀʏ ʏᴏᴜʀ ɴɪɢʜᴛ ʙᴇ ᴀꜱ ᴘᴇᴀᴄᴇꜰᴜʟ ᴀꜱ ᴀ ꜱᴇʀᴇɴᴇ ʟᴀᴋᴇ ᴀɴᴅ ᴀꜱ ᴄᴀʟᴍ ᴀꜱ ᴀ ɢᴇɴᴛʟᴇ ʙʀᴇᴇᴢᴇ. ᴀꜱ ʏᴏᴜ ᴄʟᴏꜱᴇ ʏᴏᴜʀ ᴇʏᴇꜱ, ʟᴇᴛ ɢᴏ ᴏꜰ ᴀʟʟ ᴛʜᴇ ᴅᴀʏ'ꜱ ᴡᴏʀʀɪᴇꜱ ᴀɴᴅ ʟᴇᴛ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ᴛᴀᴋᴇ ʏᴏᴜ ᴛᴏ ᴀ ᴡᴏʀʟᴅ ᴏꜰ ʜᴀᴘᴘɪɴᴇꜱꜱ ᴀɴᴅ ᴊᴏʏ. ɢᴏᴏᴅ ɴɪɢʜᴛ, ᴀɴᴅ ᴍᴀʏ ʏᴏᴜ ᴡᴀᴋᴇ ᴜᴘ ʀᴇꜰʀᴇꜱʜᴇᴅ ᴀɴᴅ ᴇxᴄɪᴛᴇᴅ ꜰᴏʀ ᴛʜᴇ ᴀᴅᴠᴇɴᴛᴜʀᴇꜱ ᴏꜰ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ ᴀʜᴇᴀᴅ!", "🌙 ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ᴛʜᴇ ꜱᴛᴀʀꜱ ꜱʜɪɴᴇ ʙʀɪɢʜᴛʟʏ ᴏᴠᴇʀ ʏᴏᴜ ᴀɴᴅ ɢᴜɪᴅᴇ ʏᴏᴜ ᴛᴏ ᴀ ᴘᴇᴀᴄᴇꜰᴜʟ ꜱʟᴇᴇᴘ. ᴀꜱ ʏᴏᴜ ᴅʀɪꜰᴛ ɪɴᴛᴏ ᴅʀᴇᴀᴍʟᴀɴᴅ, ᴍᴀʏ ʏᴏᴜʀ ᴍɪɴᴅ ʙᴇ ꜰʀᴇᴇ ᴏꜰ ᴡᴏʀʀɪᴇꜱ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ꜰᴜʟʟ ᴏꜰ ᴊᴏʏ. ʀᴇᴍᴇᴍʙᴇʀ, ᴇᴠᴇʀʏ ɴɪɢʜᴛ ɪꜱ ᴀ ᴄʜᴀɴᴄᴇ ᴛᴏ ʀᴇꜱᴇᴛ ᴀɴᴅ ʀᴇᴄʜᴀʀɢᴇ, ꜱᴏ ᴛᴀᴋᴇ ᴛʜɪꜱ ᴛɪᴍᴇ ᴛᴏ ʀᴇʟᴀx ᴀɴᴅ ᴇɴᴊᴏʏ ᴛʜᴇ ꜱᴇʀᴇɴɪᴛʏ ᴏꜰ ᴛʜᴇ ɴɪɢʜᴛ. ꜱʟᴇᴇᴘ ᴛɪɢʜᴛ!", "🌜 ɢᴏᴏᴅ ɴɪɢʜᴛ! ᴍᴀʏ ʏᴏᴜʀ ᴅʀᴇᴀᴍꜱ ʙᴇ ᴀꜱ ꜱᴡᴇᴇᴛ ᴀꜱ ᴛʜᴇ ꜰɪʀꜱᴛ ʙɪᴛᴇ ᴏꜰ ʏᴏᴜʀ ꜰᴀᴠᴏʀɪᴛᴇ ᴅᴇꜱꜱᴇʀᴛ ᴀɴᴅ ᴀꜱ ᴄᴏᴍꜰᴏʀᴛɪɴɢ ᴀꜱ ᴀ ᴡᴀʀᴍ ʜᴜɢ. ᴀꜱ ʏᴏᴜ ᴅʀɪꜰᴛ ᴏꜰꜰ ᴛᴏ ꜱʟᴇᴇᴘ, ʟᴇᴛ ʏᴏᴜʀ ᴍɪɴᴅ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴘᴇᴀᴄᴇꜰᴜʟ ᴛʜᴏᴜɢʜᴛꜱ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ʟɪɢʜᴛ. ʀᴇᴍᴇᴍʙᴇʀ, ᴇᴠᴇʀʏ ᴅʀᴇᴀᴍ ɪꜱ ᴀ ᴄʜᴀɴᴄᴇ ᴛᴏ ᴇxᴘʟᴏʀᴇ ɴᴇᴡ ᴡᴏʀʟᴅꜱ ᴀɴᴅ ᴍᴀᴋᴇ ɴᴇᴡ ᴍᴇᴍᴏʀɪᴇꜱ. ꜱʟᴇᴇᴘ ᴡᴇʟʟ ᴀɴᴅ ʜᴀᴠᴇ ᴀ ᴡᴏɴᴅᴇʀꜰᴜʟ ɴɪɢʜᴛ!", ]
morning_shayari = [ "🌅 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ᴀꜱ ʙʀɪɢʜᴛ ᴀɴᴅ ᴄʜᴇᴇʀꜰᴜʟ ᴀꜱ ᴛʜᴇ ʀɪꜱɪɴɢ ꜱᴜɴ. ᴀꜱ ʏᴏᴜ ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ, ʟᴇᴛ ᴘᴏꜱɪᴛɪᴠɪᴛʏ ᴀɴᴅ ᴊᴏʏ ꜰɪʟʟ ʏᴏᴜʀ ʜᴇᴀʀᴛ. ᴇᴍʙʀᴀᴄᴇ ᴇᴠᴇʀʏ ᴍᴏᴍᴇɴᴛ ᴡɪᴛʜ ᴀ ꜱᴍɪʟᴇ ᴀɴᴅ ʟᴇᴛ ʏᴏᴜʀ ᴇɴᴛʜᴜꜱɪᴀꜱᴍ ꜱʜɪɴᴇ ᴛʜʀᴏᴜɢʜ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴛʜᴇ ᴀʀᴏᴍᴀ ᴏꜰ ꜰʀᴇꜱʜ ᴄᴏꜰꜰᴇᴇ ᴀɴᴅ ᴛʜᴇ ᴘʀᴏᴍɪꜱᴇ ᴏꜰ ᴀ ᴡᴏɴᴅᴇʀꜰᴜʟ ᴅᴀʏ ᴀʜᴇᴀᴅ. ʀɪꜱᴇ ᴀɴᴅ ꜱʜɪɴᴇ, ᴀɴᴅ ᴍᴀᴋᴇ ᴛᴏᴅᴀʏ ᴀᴍᴀᴢɪɴɢ!", "🌞 ʀɪꜱᴇ ᴀɴᴅ ꜱʜɪɴᴇ! ᴀ ɴᴇᴡ ᴅᴀʏ ɪꜱ ʜᴇʀᴇ, ꜰᴜʟʟ ᴏꜰ ᴏᴘᴘᴏʀᴛᴜɴɪᴛɪᴇꜱ ᴀɴᴅ ᴀᴅᴠᴇɴᴛᴜʀᴇꜱ ᴡᴀɪᴛɪɴɢ ꜰᴏʀ ʏᴏᴜ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ʀᴇꜰʀᴇꜱʜɪɴɢ ᴀꜱ ᴀ ᴄᴏᴏʟ ʙʀᴇᴇᴢᴇ ᴀɴᴅ ᴀꜱ ᴠɪʙʀᴀɴᴛ ᴀꜱ ᴀ ʙʟᴏᴏᴍɪɴɢ ꜰʟᴏᴡᴇʀ. ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ ᴡɪᴛʜ ᴀ ꜱᴍɪʟᴇ ᴀɴᴅ ᴀ ʜᴇᴀʀᴛ ꜰᴜʟʟ ᴏꜰ ʜᴏᴘᴇ. ʀᴇᴍᴇᴍʙᴇʀ, ᴇᴠᴇʀʏ ꜱᴜɴʀɪꜱᴇ ɪꜱ ᴀ ɴᴇᴡ ʙᴇɢɪɴɴɪɴɢ, ꜱᴏ ᴍᴀᴋᴇ ᴛʜᴇ ᴍᴏꜱᴛ ᴏꜰ ɪᴛ ᴀɴᴅ ʜᴀᴠᴇ ᴀ ꜰᴀɴᴛᴀꜱᴛɪᴄ ᴅᴀʏ!", "🌄 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ʜᴀᴘᴘɪɴᴇꜱꜱ ᴀɴᴅ ꜱᴜᴄᴄᴇꜱꜱ. ᴀꜱ ʏᴏᴜ ᴏᴘᴇɴ ʏᴏᴜʀ ᴇʏᴇꜱ ᴛᴏ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ, ʟᴇᴛ ɢᴏ ᴏꜰ ᴀɴʏ ɴᴇɢᴀᴛɪᴠɪᴛʏ ᴀɴᴅ ᴇᴍʙʀᴀᴄᴇ ᴛʜᴇ ᴘᴏꜱɪᴛɪᴠᴇ ᴇɴᴇʀɢʏ ᴀʀᴏᴜɴᴅ ʏᴏᴜ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ʙʀɪɢʜᴛ ᴀɴᴅ ʏᴏᴜʀ ꜱᴘɪʀɪᴛ ʜɪɢʜ. ᴡɪᴛʜ ᴇᴀᴄʜ ꜱᴛᴇᴘ ʏᴏᴜ ᴛᴀᴋᴇ, ᴍᴀʏ ʏᴏᴜ ꜰɪɴᴅ ᴊᴏʏ ᴀɴᴅ ꜰᴜʟꜰɪʟʟᴍᴇɴᴛ. ʜᴀᴠᴇ ᴀ ᴡᴏɴᴅᴇʀꜰᴜʟ ᴅᴀʏ ᴀʜᴇᴀᴅ!", "🌻 ᴡᴀᴋᴇ ᴜᴘ ᴀɴᴅ ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ ᴡɪᴛʜ ᴀ ʜᴇᴀʀᴛ ꜰᴜʟʟ ᴏꜰ ɢʀᴀᴛɪᴛᴜᴅᴇ ᴀɴᴅ ᴀ ꜱᴍɪʟᴇ ᴏɴ ʏᴏᴜʀ ꜰᴀᴄᴇ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ʟᴏᴠᴇʟʏ ᴀꜱ ᴀ ʙᴏᴜQᴜᴇᴛ ᴏꜰ ꜰʀᴇꜱʜ ꜰʟᴏᴡᴇʀꜱ ᴀɴᴅ ᴀꜱ ᴜᴘʟɪꜰᴛɪɴɢ ᴀꜱ ᴀ ᴄʜᴇᴇʀꜰᴜʟ ꜱᴏɴɢ. ᴇᴍʙʀᴀᴄᴇ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ ᴡɪᴛʜ ᴇɴᴛʜᴜꜱɪᴀꜱᴍ ᴀɴᴅ ʟᴇᴛ ɪᴛ ʙʀɪɴɢ ʏᴏᴜ ᴀʟʟ ᴛʜᴇ ʜᴀᴘᴘɪɴᴇꜱꜱ ᴀɴᴅ ꜱᴜᴄᴄᴇꜱꜱ ʏᴏᴜ ᴅᴇꜱᴇʀᴠᴇ. ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴀɴᴅ ʜᴀᴠᴇ ᴀ ꜰᴀʙᴜʟᴏᴜꜱ ᴅᴀʏ!", "🌞 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴊᴏʏ ᴀɴᴅ ᴇxᴄɪᴛᴇᴍᴇɴᴛ. ᴀꜱ ʏᴏᴜ ꜱᴛᴇᴘ ɪɴᴛᴏ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ, ʟᴇᴛ ʏᴏᴜʀ ᴘᴏꜱɪᴛɪᴠɪᴛʏ ᴀɴᴅ ᴇɴᴇʀɢʏ ꜱʜɪɴᴇ ʙʀɪɢʜᴛʟʏ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ᴠɪʙʀᴀɴᴛ ᴀꜱ ᴀ ꜱᴜɴɴʏ ᴅᴀʏ ᴀɴᴅ ᴀꜱ ʀᴇꜰʀᴇꜱʜɪɴɢ ᴀꜱ ᴀ ᴄᴏᴏʟ ᴅʀɪɴᴋ. ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ ᴡɪᴛʜ ᴀ ꜱᴍɪʟᴇ ᴀɴᴅ ʟᴇᴛ ᴛʜᴇ ᴡᴏʀʟᴅ ꜱᴇᴇ ʏᴏᴜʀ ᴡᴏɴᴅᴇʀꜰᴜʟ ꜱᴘɪʀɪᴛ. ʜᴀᴠᴇ ᴀ ɢʀᴇᴀᴛ ᴅᴀʏ ᴀʜᴇᴀᴅ!", "🌄 ʀɪꜱᴇ ᴀɴᴅ ꜱʜɪɴᴇ! ᴀ ɴᴇᴡ ᴅᴀʏ ɪꜱ ʜᴇʀᴇ, ꜰᴜʟʟ ᴏꜰ ᴘʀᴏᴍɪꜱᴇ ᴀɴᴅ ᴘᴏꜱꜱɪʙɪʟɪᴛɪᴇꜱ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ʙᴇᴀᴜᴛɪꜰᴜʟ ᴀꜱ ᴀ ꜱᴜɴʀɪꜱᴇ ᴀɴᴅ ᴀꜱ ɪɴꜱᴘɪʀɪɴɢ ᴀꜱ ᴀ ɴᴇᴡ ʙᴇɢɪɴɴɪɴɢ. ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ ᴡɪᴛʜ ᴀ ᴘᴏꜱɪᴛɪᴠᴇ ᴍɪɴᴅꜱᴇᴛ ᴀɴᴅ ʟᴇᴛ ʏᴏᴜʀ ᴊᴏʏ ᴀɴᴅ ᴇɴᴛʜᴜꜱɪᴀꜱᴍ ɢᴜɪᴅᴇ ʏᴏᴜ. ᴍᴀʏ ᴛᴏᴅᴀʏ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴡᴏɴᴅᴇʀꜰᴜʟ ᴍᴏᴍᴇɴᴛꜱ ᴀɴᴅ ᴀᴍᴀᴢɪɴɢ ᴏᴘᴘᴏʀᴛᴜɴɪᴛɪᴇꜱ. ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ!", "🌻 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ꜱᴜɴꜱʜɪɴᴇ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ᴡɪᴛʜ ʜᴀᴘᴘɪɴᴇꜱꜱ. ᴀꜱ ʏᴏᴜ ʙᴇɢɪɴ ʏᴏᴜʀ ᴅᴀʏ, ʟᴇᴛ ɢᴏ ᴏꜰ ᴀɴʏ ᴡᴏʀʀɪᴇꜱ ᴀɴᴅ ꜰᴏᴄᴜꜱ ᴏɴ ᴛʜᴇ ᴊᴏʏ ᴀɴᴅ ᴇxᴄɪᴛᴇᴍᴇɴᴛ ᴛʜᴀᴛ ʟɪᴇ ᴀʜᴇᴀᴅ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ᴅᴇʟɪɢʜᴛꜰᴜʟ ᴀꜱ ᴀ ꜰʀᴇꜱʜ ᴄᴜᴘ ᴏꜰ ᴄᴏꜰꜰᴇᴇ ᴀɴᴅ ᴀꜱ ᴜᴘʟɪꜰᴛɪɴɢ ᴀꜱ ᴀ ꜰʀɪᴇɴᴅʟʏ ꜱᴍɪʟᴇ. ʀɪꜱᴇ ᴀɴᴅ ꜱʜɪɴᴇ, ᴀɴᴅ ᴍᴀᴋᴇ ᴛᴏᴅᴀʏ ɪɴᴄʀᴇᴅɪʙʟᴇ!", "🌞 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ᴀꜱ ʙʀɪɢʜᴛ ᴀɴᴅ ᴄʜᴇᴇʀꜰᴜʟ ᴀꜱ ʏᴏᴜʀ ꜱᴍɪʟᴇ. ᴀꜱ ʏᴏᴜ ᴏᴘᴇɴ ʏᴏᴜʀ ᴇʏᴇꜱ ᴛᴏ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ, ʟᴇᴛ ʏᴏᴜʀ ᴘᴏꜱɪᴛɪᴠɪᴛʏ ᴀɴᴅ ᴇɴᴛʜᴜꜱɪᴀꜱᴍ ꜱᴇᴛ ᴛʜᴇ ᴛᴏɴᴇ ꜰᴏʀ ᴛʜᴇ ʜᴏᴜʀꜱ ᴀʜᴇᴀᴅ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ʟᴏᴠᴇ, ʟᴀᴜɢʜᴛᴇʀ, ᴀɴᴅ ᴀʟʟ ᴛʜᴇ ᴛʜɪɴɢꜱ ᴛʜᴀᴛ ᴍᴀᴋᴇ ʏᴏᴜ ʜᴀᴘᴘʏ. ᴇᴍʙʀᴀᴄᴇ ᴛʜᴇ ᴅᴀʏ ᴡɪᴛʜ ᴏᴘᴇɴ ᴀʀᴍꜱ ᴀɴᴅ ᴀ ᴊᴏʏꜰᴜʟ ʜᴇᴀʀᴛ!", "🌄 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ! ᴍᴀʏ ʏᴏᴜʀ ᴅᴀʏ ʙᴇ ꜰɪʟʟᴇᴅ ᴡɪᴛʜ ᴇɴᴅʟᴇꜱꜱ ᴘᴏꜱꜱɪʙɪʟɪᴛɪᴇꜱ ᴀɴᴅ ᴊᴏʏꜰᴜʟ ᴍᴏᴍᴇɴᴛꜱ. ᴀꜱ ʏᴏᴜ ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ, ʟᴇᴛ ʏᴏᴜʀ ꜱᴘɪʀɪᴛ ꜱᴏᴀʀ ᴀɴᴅ ʏᴏᴜʀ ʜᴇᴀʀᴛ ʙᴇ ʟɪɢʜᴛ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ꜰʀᴇꜱʜ ᴀɴᴅ ɪɴᴠɪɢᴏʀᴀᴛɪɴɢ ᴀꜱ ᴀ ɢᴇɴᴛʟᴇ ʙʀᴇᴇᴢᴇ ᴀɴᴅ ᴀꜱ ʙʀɪɢʜᴛ ᴀꜱ ᴛʜᴇ ꜱᴜɴ. ᴡᴇʟᴄᴏᴍᴇ ᴛʜᴇ ɴᴇᴡ ᴅᴀʏ ᴡɪᴛʜ ᴀ ꜱᴍɪʟᴇ ᴀɴᴅ ʟᴇᴛ ɪᴛ ʙʀɪɴɢ ʏᴏᴜ ᴀʟʟ ᴛʜᴇ ʜᴀᴘᴘɪɴᴇꜱꜱ ʏᴏᴜ ᴅᴇꜱᴇʀᴠᴇ.", "🌞 ʀɪꜱᴇ ᴀɴᴅ ꜱʜɪɴᴇ! ɪᴛ’ꜱ ᴀ ʙʀᴀɴᴅ ɴᴇᴡ ᴅᴀʏ ꜰᴜʟʟ ᴏꜰ ᴏᴘᴘᴏʀᴛᴜɴɪᴛɪᴇꜱ ᴀɴᴅ ᴀᴅᴠᴇɴᴛᴜʀᴇꜱ. ᴍᴀʏ ʏᴏᴜʀ ᴍᴏʀɴɪɴɢ ʙᴇ ᴀꜱ ʟɪᴠᴇʟʏ ᴀꜱ ᴀ ꜱᴜɴʀɪꜱᴇ ᴀɴᴅ ᴀꜱ ɪɴꜱᴘɪʀɪɴɢ ᴀꜱ ᴀ ɴᴇᴡ ʙᴇɢɪɴɴɪɴɢ. ꜱᴛᴀʀᴛ ʏᴏᴜʀ ᴅᴀʏ ᴡɪᴛʜ ᴀ ᴘᴏꜱɪᴛɪᴠᴇ ᴀᴛᴛɪᴛᴜᴅᴇ ᴀɴᴅ ʟᴇᴛ ᴛʜᴇ ᴡᴏʀʟᴅ ꜱᴇᴇ ʏᴏᴜʀ ʙʀɪʟʟɪᴀɴᴄᴇ. ᴍᴀʏ ᴛᴏᴅᴀʏ ʙʀɪɴɢ ʏᴏᴜ ᴊᴏʏ, ꜱᴜᴄᴄᴇꜱꜱ, ᴀɴᴅ ᴀʟʟ ᴛʜᴇ ᴛʜɪɴɢꜱ ᴛʜᴀᴛ ᴍᴀᴋᴇ ʏᴏᴜ ꜱᴍɪʟᴇ. ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ!", ]



add_buttons = InlineKeyboardMarkup(
    [
        [
            InlineKeyboardButton(
                text="๏ ᴀᴅᴅ ᴍᴇ ɪɴ ɢʀᴏᴜᴘ ๏",
                url=f"https://t.me/{app.username}?startgroup=true",
            )
        ]
    ]
)

# Function to send a "Good Night" message
async def send_good_night():
    chats = []
    schats = await get_served_chats()
    for chat in schats:
        chats.append(int(chat["chat_id"]))
    if len(chats) == 0:
        return
    for chat_id in chats:
        try:
            if chat_id == -1002146211959:
                continue
            shayari = random.choice(night_shayari)
            await app.send_photo(
                chat_id,
                photo="https://telegra.ph//file/06649d4d0bbf4285238ee.jpg",
                caption=f"**{shayari}**",
                reply_markup=add_buttons,
            )
        except Exception as e:
            print(f"[bold red] Unable to send Good Night message to Group {chat_id} - {e}")

scheduler.add_job(send_good_night, trigger="cron", hour=23, minute=59)

# Function to send a "Good Morning" message
async def send_good_morning():
    chats = []
    schats = await get_served_chats()
    for chat in schats:
        chats.append(int(chat["chat_id"]))
    if len(chats) == 0:
        return
    for chat_id in chats:
        try:
            if chat_id == -1002146211959:
                continue
            shayari = random.choice(morning_shayari)
            await app.send_photo(
                chat_id,
                photo="https://telegra.ph//file/14ec9c3ff42b59867040a.jpg",
                caption=f"**{shayari}**",
                reply_markup=add_buttons,
            )
        except Exception as e:
            print(f"[bold red] Unable to send Good Morning message to Group {chat_id} - {e}")

scheduler.add_job(send_good_morning, trigger="cron", hour=6, minute=1)
scheduler.start()

